import asyncio

from app.databases.mongo_db import MongoDBDatabase
from app.dina.models.service_procedure import ServiceProcedure, ServiceType


async def add_service():
    mdb = MongoDBDatabase()
    await mdb.add_entry(
        ServiceType(
            name="пасош",
            desc="""Пасошот преставува задолжителен документ за патување во странство на сите граѓани на Република Македонија.\n   
Патната исправа пасош имаат право да извадат сите граѓани без огранучување на возраста. За граѓаните кои не се полнолетни потребно е согласност од нивните родители и нивно присуство при вадењето на пасошот.\n
Пасошот има вашност од 2 години за граѓани помлади од 4 години, За граѓани постари од 4 години а помлади од 27 години пасошот се издава со рок од 5 години, За граѓани постари од 27 години пасошот се издава со вашност од 10 години.\n
Граѓанинот кој не е полнолетен должен е да приложи извод од матична книга на родени во полициското оделение заедно со барањето за вадење на пасош при аплицирањето.\n
Секој полнолетен граѓанин е должен со себе да го носи стариот пасош и лична карта при вадење на нов пасош поради истекување, оштетување, или исполнетост на стариот пасош."""
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на завршена пасош и пасош по прв пат на полнолетен граѓанин",
            desc="""- Граѓанинот за да извади Пасош има должност да поденсе барање за вадење на Пасош, во полициското оделение каде што сака да го извади пасошот.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 1200 денари.
- Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе го извади пасошот со електронска картичка.
- Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
- Граѓанинот е должен да го достави стариот пасош на денот на подигање на новиот пасош со што Министерството за внатрешни работи го понуштува стариот.""",
            service_type="пасош"
        )
    )
    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на загубен,оштетен, украден или исполнет Пасош",
            desc="""- Граѓанинот е должен да пријави во Министерството за внатрешни работи за украден или загубен Пасош.
- Во случај на оштетен или исполнет пасош граѓанинот е должен да го носи со себе стариот пасош со цел да се докаже дека не повеќе во состојба да се користи пасошот.
- Во случај на загубен или украден пасош граѓанинот е должен да изврши објава во Службен весник за загубен Пасош во просториите на службен весник.
- Граѓанинот за да извади Пасош има должност да поденсе барање за извадање на Пасош, во полициското оделение каде што сака да го извади пасошот.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 1500 денари и уплатница во вредност од 200 денари административна такса.
- Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе го извади пасошот со електронска картичка.
- Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
- Министерството за внатрешни работи врши поништување на стариот пасош при подигање на нов.""",
            service_type="пасош"
        )
    )

    await mdb.add_entry(
        ServiceType(
            name="возачка",
            desc="""Право на возачка дозвола имаат сите полнолетни граѓани на Република Македонија кои имаат положено испит за возачка дозвола од овластено правно лице.\n
Возачката дозвола се издава во времетраење од 10 години.\n
Граѓанинот кој поседува возачка дозвола помалку од 2 години не смее да управува со возило кое има моќност поголема од 77 kw.\n
Граѓанинот кој поседува возачка дозвола помалку од 2 години не смее да управува со возило помеѓу 23-05 часот.\n
Граѓанинот кој управува возило во странство со македонска возачка дозвола должен е да ги почитува законите и огранучувањата на државата во која го управува возилото."""
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на возачка дозвола по прв пат",
            desc="""- Граѓанинот за да извади возачка дозвола има должност да поденсе барање за извадање на возачка дозвола, во полициското оделение каде што сака да ја извади возачката дозвола.
- Граѓанинот е должен да изврши уплата по уплатница во вредност од 550 денари или да ја изврши уплатата во полициското оделение каде што ќе ја вади возачката дозвола со електронска картичка.
- Граѓанинот мора да има положено возачки испит во овластено правно лице за спроведување на возачки испит.
- Потврда од положениот возачки испит треба граѓанинот да ја однесе во полициското оделение каде што ќе ја вади возачката дозвола.
- Граѓанинот со себе е должен да носи лична карта при вадење на возачката дозвола.""",
            service_type="возачка"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на возачка дозвола поради истекување",
            desc="""- Граѓанинот за да извади возачка дозвола има должност да поденсе барање за извадање на возачка дозвола, во полициското оделение каде што сака да ја извади возачката дозвола.
- Граѓанинот е должен да изврши уплата по уплатница во вредност од 550 денари или да ја изврши уплатата во полициското оделение каде што ќе ја вади возачката дозвола со електронска картичка.
- Граѓанинот со себе треба да ја носи старата возачка дозвола при вадењето на нова возачка дозвола.
- Граѓанинот со себе е должен да носи лична карта при вадење на возачката дозвола.""",
            service_type="возачка"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на украдена,оштетена или загубена возачка дозвола",
            desc="""- Граѓанинот за да извади возачка дозвола има должност да поденсе барање за извадање
на возачка дозвола, во полициското оделение каде што сака да ја извади возачката
дозвола.
- Граѓанинот е должен да изврши уплата по уплатница во вредност од 550 денари или да ја
изврши уплатата во полициското оделение каде што ќе ја вади возачката дозвола со
електронска картичка.
- Во случај на оштетена возачка дозвола граѓанинот со себе треба да ја носи оштетената
возачка дозвола при вадењето на нова возачка дозвола.
- Во случај на украдена или загубена возачка дозвола граѓанинот е должен да изврши објава
во службен весник за загубена возачка дозвола во просториите на службен весник.
- Граѓанинот со себе е должен да носи лична карта при вадење на возачката дозвола.""",
            service_type="возачка"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на возачка дозвола од Ц-категорија",
            desc="""- Граѓанинот за да извади возачка дозвола има должност да поденсе барање за извадање на возачка дозвола, во полициското оделение каде што сака да ја извади возачката дозвола.
- Граѓанинот е должен да изврши уплата по уплатница во вредност од 550 денари или да ја изврши уплатата во полициското оделение каде што ќе ја вади возачката дозвола со електронска картичка.
- Граѓанинот треба да има наполнети 24 години и возачка за Б-категорија во времетраење од 4 години.
- Граѓанинот мора да има положено возачки испит во овластено правно лице за спроведување на возачки испит за Ц-категорија.
- Потврда од положениот возачки испит треба граѓанинот да ја однесе во полициското оделение каде што ќе ја вади возачката дозвола.
- Граѓанинот со себе е должен да ја носи старата возачка дозвола со Б-категорија.
- Граѓанинот со себе е должен да носи лична карта при вадење на возачката дозвола.""",
            service_type="возачка"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на возачка дозвола од Д-категорија",
            desc="""- Граѓанинот за да извади возачка дозвола има должност да поденсе барање за извадање на возачка дозвола, во полициското оделение каде што сака да ја извади возачката дозвола.
- Граѓанинот е должен да изврши уплата по уплатница во вредност од 550 денари или да ја изврши уплатата во полициското оделение каде што ќе ја вади возачката дозвола со електронска картичка.
- Граѓанинот треба да има наполнети 28 години и возачка за Ц-категорија во времетраење од 6 години.
- Граѓанинот мора да има положено возачки испит во овластено правно лице за спроведување на возачки испит за Д-категорија.
- Потврда од положениот возачки испит треба граѓанинот да ја однесе во полициското оделение каде што ќе ја вади возачката дозвола.
- Граѓанинот со себе е должен да ја носи старата возачка дозвола со Ц-категорија.
- Граѓанинот со себе е должен да носи лична карта при вадење на возачката дозвола.""",
            service_type="возачка"
        )
    )

    await mdb.add_entry(
        ServiceType(
            name="запишување во матични книги",
            desc="""- Сите уплати се вршат преку овластени банки или во канцеларијата со електронска картичка.\n
- Лажни податоци или изоставување на документи водат кон административни и кривични санкции.\n
- Податоците се чуваат во централен регистар и се достапни за овластени институции.\n
- Рок за решавање на барањето: до 7 работни дена од поднесувањето."""
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Запишување во матична книга на родени",
            desc="""Процедура за запишување:
- Граѓанинот (родител или законски застапник) има должност да поднесе барање за запишување во матична книга на родени во месната канцеларија на Управата за матични книги.
- Барањето мора да се поднесе во рок од 15 дена од денот на раѓањето. Потребни документи:
1. Лекарско потврдување за раѓање (оригинал).
2. Лични карти на двата родители (копии).
3. Бракодоговор (доколку родителите се во брак).
4. Документ за идентитет на подносителот.
Такси:
- 300 денари (уплата преку уплатница).
Дополнителни белешки:
- Записот вршат родителите или овластено лице со нотарски заверена доверба.
- Во случај на вонбрачно дете, потребна е изјава од двата родители.""",
            service_type="запишување во матични книги"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Запишување во матична книга на венчани",
            desc="""Процедура за запишување:
- Брачните партнери се должни да поднесат барање за запишување во матична книга на венчани во канцеларијата каде се извршило венчавањето.
Потребни документи:
1. Лични карти на двата брачни партнери (копии).
2. Службен документ за слободен брачен статус (извод од матична книга на родени или претходен развод).
3. Присуство на минимум два сведоци со лични карти.
4. Потврда за одржана граѓанска или верска церемонија.
Такси:
- 500 денари (уплата преку уплатница).
Дополнителни белешки:
- Ако еден од партнерите е странец, потребен е преведен и легализиран документ за брачна способност.
- Брачниот договор (ако постои) мора да се приложи.""",
            service_type="запишување во матични книги"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Запишување во матична книга на умрени",
            desc="""Процедура за запишување:
- Блискиот роднина или законскиот застапник има должност да поднесе барање за запишување во матична книга на умрени во месната канцеларија во рок од 5 работни дена од смртта.
Потребни документи:
1. Лекарско потврдување за смрт (оригинал).
2. Лична карта на починатиот (копија).
3. Документ за идентитет на подносителот.
4. Смртовница (доколку е издадена).
Такси:
- 200 денари (уплата преку уплатница).
Дополнителни белешки:
- Во случај на ненадејна смрт, потребна е дополнителна документација од судскиот лекар.
- Ако подносителот не е роднина, потребна е нотарска доверба.""",
            service_type="запишување во матични книги"
        )
    )

    await mdb.add_entry(
        ServiceType(
            name="вадење на извод од матична книга",
            desc="""- Сите изводи се валидни 6 месеци од датумот на издавање.
- При поднесување на лажни податоци се предвидени кривични и административни санкции.
- Уплатите се вршат преку овластени банки или во канцеларијата.
- Издадените изводи се официјални документи и мора да се чуваат со грижа."""
        )
    )


    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на извод од матична книга на родени за полнолетен граѓанин",
            desc="""- Граѓанинот за да извади извод од матична книга на родени има должност да поднесе барање во месната канцеларија на Управата за матични книги.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 100 денари (такса) и 50 денари (а дминистративна такса).
- Уплатата граѓанинот може да ја изврши и во канцеларијата каде што ќе го поднесе барањето со електронска картичка.
- Граѓанинот треба лично да отиде со барањето и важечка лична карта.
- Изводот се издава во рок од 3 работни дена.""",
            service_type="вадење на извод од матична книга"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на извод за малолетен граѓанин",
            desc="""- Родителите или законските застапници се должни да поднесат барање со приложен документ за идентитет и согласност.
- Потребно е присуство на еден родител/законски застапник.""",
            service_type="вадење на извод од матична книга"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на извод на венчани",
            desc="""- Граѓанинот за да извади извод од матична книга на венчани има должност да поднесе барање во канцеларијата каде е регистриран бракот.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 150 денари (такса) и 50 денари (административна такса).
- Уплатата може да се изврши и на лице место со електронска картичка.
- Потребно е приложување на копија од лични карти на брачните партнери.
- Изводот се издава во рок од 5 работни дена.""",
            service_type="вадење на извод од матична книга"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење во случај на смрт на еден од партнерите",
            desc="""Наследникот или законскиот застапник мора да приложи смртовница и документ за идентитет.""",
            service_type="вадење на извод од матична книга"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на извод за починат граѓанин",
            desc="""- Граѓанинот за да извади извод од матична книга на умрени има должност да поднесе барање во месната канцеларија каде е регистрирана смртта.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 100 денари (такса) и 50 денари (административна такса).
- Потребно е приложување на документ за идентитет на подносителот и копија од смртовницата.
- Изводот се издава во рок од 5 работни дена.""",
            service_type="вадење на извод од матична книга"
        )
    )

    await mdb.add_entry(
        ServiceType(
            name="лична карта",
            desc="""Личната карта преставува задолжителен документ за сите полнолетни граѓани на Република Северна Македонија, сите полнолетни граѓани се должни да ја носат личната карта со себе.
Личната карта се издава со важност од 5 години за граѓани помлади од 27 години. Со важност од 10 години за лица постари од 27 години и со трајна важност за лица постари од 65 години.
Секој граѓанин е должен да поднесе барање за вадење лична карта најдоца 30 дена пред истекот на старата лична карта.
Граѓанинот личната карта може да ја извади само во полициско оделение кое се наоѓа во регионот на неговата адреса на живеење."""
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на завршена лична карта и лична карта по прв пат на полнолетен граѓанин",
            desc="""- Граѓанинот за да извади лична карта има должност да поденсе барање за извадање на лична карта, во полициското оделение каде што сака да ја извади личната карта.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 310 денари.
- Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе ја извади личната карта.
- Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
- Граѓанинот е должен да ја остави старата лична карта на денот на подигање на новата лична карта.""",
            service_type="лична карта"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на лична карта за граѓани со наполнети 15 години",
            desc="""- Граѓанинот за да извади лична карта има должност да поденсе барање за извадање на лична карта, во полициското оделение каде што сака да ја извади личната карта.
- Граѓанинот е должен да отиде во полисицкото оделение со своите родители и да добие согласност од нив.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 310 денари.
- Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе ја извади личната карта.
- Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
- Граѓанинот е должен да ја остави старата лична карта на денот на подигање на новата лична карта.""",
            service_type="лична карта"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на загубена,оштетена или украдена лична карта",
            desc="""- Граѓанинот е должен да пријави во Министерството за внатрешни работи за укреданата или загубената лична карта.
- Граѓанинот е должен да изврши објава во Службен весник за загубена лична карта во просториите на службен весник.
- Граѓанинот за да извади лична карта има должност да поденсе барање за извадање на лична карта, во полициското оделение каде што сака да ја извади личната карта.
- Граѓанинот е должен да изврши уплата според уплатница, во вредност од 310 денари.
- Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе ја извади личната карта.
- Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
- Граѓанинот е должен да ја остави старата лична карта на денот на подигање на новата лична карта.""",
            service_type="лична карта"
        )
    )

    await mdb.add_entry(
        ServiceProcedure(
            name="Вадење на загубена,оштетена или украдена лична карта",
            desc="""- Граѓанинот е должен да пријави во Министерството за внатрешни работи за укреданата или загубената лична карта.
    - Граѓанинот е должен да изврши објава во Службен весник за загубена лична карта во просториите на службен весник.
    - Граѓанинот за да извади лична карта има должност да поденсе барање за извадање на лична карта, во полициското оделение каде што сака да ја извади личната карта.
    - Граѓанинот е должен да изврши уплата според уплатница, во вредност од 310 денари.
    - Уплатата граѓанинот може да ја изврши и во полициското оделение каде што ќе ја извади личната карта.
    - Граѓанинот треба лично да отиде со барањето во полициското оделение и да биде сликан од страна на овластен службеник.
    - Граѓанинот е должен да ја остави старата лична карта на денот на подигање на новата лична карта.""",
            service_type="лична карта"
        )
    )

#asyncio.run(add_service())
